In [1]:
import pandas as pd
import numpy as np

In [2]:
l = [12,44,66,32,48]

In [5]:
pd.DataFrame(l,columns = ["variable_name"])

   variable_name
0             12
1             44
2             66
3             32
4             48

In [6]:
m = np.arange(1,10).reshape((3,3))

In [9]:
df = pd.DataFrame(m,columns = ["var1","var2","var3"],index = [1,2,3])

In [10]:
df

   var1  var2  var3
1     1     2     3
2     4     5     6
3     7     8     9

In [11]:
df.head(2)

   var1  var2  var3
1     1     2     3
2     4     5     6

In [12]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [13]:
df.axes

[Int64Index([1, 2, 3], dtype='int64'),
 Index(['var1', 'var2', 'var3'], dtype='object')]

In [14]:
df.shape

(3, 3)

In [15]:
df.size

9

In [16]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [17]:
df.tail(1)

   var1  var2  var3
3     7     8     9

In [18]:
a = np.array([1,2,34,6])

In [19]:
pd.DataFrame(a,columns = ["lis"])

   lis
0    1
1    2
2   34
3    6